added enabled=true
updated version 1.1.10

```
Terraform will perform the following actions:

  # fivetran_connector_schema_config.dynamodb_schema will be updated in-place
  ~ resource "fivetran_connector_schema_config" "dynamodb_schema" {
      ~ id                     = "<id>" -> (known after apply)
        # (2 unchanged attributes hidden)

      - schema {
          - enabled = true -> null
          - name    = "dynamodb_raw" -> null

          - table {
              - enabled = true -> null
              - name    = "a5-a-a-U" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-c-r-S" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-d-a-1" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-g-d-d-1" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-i-o-1" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-i-o-4" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-l-l-E" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-w-d-J" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-w-d-1" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-w-d-9" -> null
            }
          - table {
              - enabled = true -> null
              - name    = "a5-w-d-1" -> null
            }
        }
      + schema {
          + enabled = (known after apply)
          + name    = "dynamodb_raw"

          + table {
              + enabled   = true
              + name      = "a5-a-a-U"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-c-r-S"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-d-a-1"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-d-h-6"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-g-d-d-1"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-i-o-1"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-i-o-4"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-l-a-8"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-l-l-E"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-w-d-J"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-w-d-1"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-w-d-9"
              + sync_mode = (known after apply)
            }
          + table {
              + enabled   = true
              + name      = "a5-w-d-1"
              + sync_mode = (known after apply)
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: .terraform/a5.out

To perform exactly these actions, run the following command to apply:
    terraform apply ".terraform/a5.out"
~/code/data/data-infra/tf-fivetran-schemas $ AWS_PROFILE="d" terraform apply .terraform/$CDK_PREFIX.out

fivetran_connector_schema_config.dynamodb_schema: Modifying... [id=<id>]
╷
│ Error: Unable to Create Connector Schema Resource.
│ 
│   with fivetran_connector_schema_config.dynamodb_schema,
│   on schema-dynamodb.tf line 24, in resource "fivetran_connector_schema_config" "dynamodb_schema":
│   24: resource "fivetran_connector_schema_config" "dynamodb_schema" {
│ 
│ Error wile applying schema config patch. error while patching schema dynamodb_raw: 
│       attempt to patch locked table a5-l-a-8; Please report this issue to the provider developers.
╵
```

a5-l-a-8 is a new table so why is it locked?
still unable to update